In [5]:
import pandas as pd

In [6]:
drinks=pd.read_csv('http://bit.ly/drinksbycountry')

In [7]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [8]:
drinks.drop('continent',axis=1).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [10]:
drinks.drop(2,axis=0).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America

In [11]:
#axis=1 is column axis
#axis=0 is row axis

In [16]:
drinks.select_dtypes(exclude=['object']).mean(axis=1)

0        0.000
1       69.975
2        9.925
3      176.850
4       81.225
        ...
188    110.925
189     29.000
190      1.525
191     14.375
192     22.675
Length: 193, dtype: float64

In [17]:
#axis=0 for an operation tells that operation should be perfromed across the rows (down the rows)(index)
#axis=1 for an operation tells that operation should be performed across the cols (right the columns)(columns)

In [18]:
import numpy as np

In [19]:
arr=np.array([[1,2,3],[4,5,6]])
arr.sum(axis=0)

array([5, 7, 9])

In [20]:
arr.sum(axis=1)

array([ 6, 15])

In [28]:
x=pd.DataFrame(columns=['q','r'])

In [30]:
pd.Series(index=[1,2,3])

1   NaN
2   NaN
3   NaN
dtype: float64